Ran Plan for 2 projects:

1. project: `prod` dir: `deployment/prod/terraform` workspace: `default`
1. project: `dev` dir: `deployment/dev/terraform` workspace: `default`
---

### 1. project: `prod` dir: `deployment/prod/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.postgres.google_sql_database_instance.default has changed
! resource "google_sql_database_instance" "default" {
        id                             = "backstage-prod"
        name                           = "backstage-prod"
        # (14 unchanged attributes hidden)

!       settings {
!           version                      = 58 -> 60
            # (13 unchanged attributes hidden)

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # postgresql_grant.database_connect["backstage_plugin_proxy"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_proxy"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = "backstage@bits-backstage-prod.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.database_connect["backstage_plugin_techdocs"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_techdocs"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = "backstage@bits-backstage-prod.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_proxy"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_proxy"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = "backstage@bits-backstage-prod.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_techdocs"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_techdocs"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = "backstage@bits-backstage-prod.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_proxy"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_proxy"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = "backstage@bits-backstage-prod.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_techdocs"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_techdocs"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = "backstage@bits-backstage-prod.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_proxy"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage_plugin_proxy"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_techdocs"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage_plugin_techdocs"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fbackstage%252Fdeployment%252Fprod%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```

**Note: Objects have changed outside of Terraform**
Plan: 8 to add, 0 to change, 0 to destroy.

---
### 2. project: `dev` dir: `deployment/dev/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.postgres.google_sql_database_instance.default has changed
! resource "google_sql_database_instance" "default" {
        id                             = "backstage-dev"
        name                           = "backstage-dev"
        # (14 unchanged attributes hidden)

!       settings {
!           version                      = 80 -> 84
            # (13 unchanged attributes hidden)

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # postgresql_grant.database_connect["backstage_plugin_proxy"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_proxy"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.database_connect["backstage_plugin_techdocs"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_techdocs"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_proxy"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_proxy"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_techdocs"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_techdocs"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_proxy"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_proxy"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_techdocs"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_techdocs"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_proxy"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-dev"
+       name            = "backstage_plugin_proxy"
+       project         = "bits-backstage-dev"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_techdocs"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-dev"
+       name            = "backstage_plugin_techdocs"
+       project         = "bits-backstage-dev"
+       self_link       = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fbackstage%252Fdeployment%252Fdev%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p dev
  ```

**Note: Objects have changed outside of Terraform**
Plan: 8 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```